NTURacingTeam/nturt_stm32_front_box/Core/Src/sensors.c
            if ( apps2 > 1.0 || apps2 < 0.0 ) {
                if(pedal_err_count.out_of_bounds.apps2 <= IMPLAUSIBILTITY_PERIOD/SENSOR_TIMER_PERIOD) {
                    pedal_err_count.out_of_bounds.apps2++;
                }
            } else pedal_err_count.out_of_bounds.apps2 = 0;

            if ( apps1-apps2 > 0.1 || apps2-apps1 > 0.1 ) {
                if(pedal_err_count.apps_disagree <= IMPLAUSIBILTITY_PERIOD/SENSOR_TIMER_PERIOD) {
                    pedal_err_count.apps_disagree++;
                }
            } else pedal_err_count.apps_disagree = 0;

            if(pedal_err_count.out_of_bounds.apps1 >= IMPLAUSIBILTITY_PERIOD/SENSOR_TIMER_PERIOD 
             || pedal_err_count.out_of_bounds.apps2 >= IMPLAUSIBILTITY_PERIOD/SENSOR_TIMER_PERIOD
             || pedal_err_count.apps_disagree >= IMPLAUSIBILTITY_PERIOD/SENSOR_TIMER_PERIOD) {
                if(!isAppsErrSet) ErrorHandler_write_error(&error_handler, ERROR_CODE_APPS_IMPLAUSIBILITY, ERROR_SET);
            }
            else if(isAppsErrSet){
                ErrorHandler_write_error(&error_handler, ERROR_CODE_APPS_IMPLAUSIBILITY, ERROR_CLEAR);
            }
            
            if(bse > 1.0 || bse < 0.0) {
                if(pedal_err_count.out_of_bounds.bse <= IMPLAUSIBILTITY_PERIOD/SENSOR_TIMER_PERIOD) {
                    pedal_err_count.out_of_bounds.bse++;
                }
            } else pedal_err_count.out_of_bounds.bse = 0;

            if(pedal_err_count.out_of_bounds.bse >= IMPLAUSIBILTITY_PERIOD/SENSOR_TIMER_PERIOD) {
                if(!isBseErrSet) ErrorHandler_write_error(&error_handler, ERROR_CODE_BSE_IMPLAUSIBILITY, ERROR_SET);
            }
            else if(isBseErrSet) {
                ErrorHandler_write_error(&error_handler, ERROR_CODE_BSE_IMPLAUSIBILITY, ERROR_CLEAR);
            }
            
            xSemaphoreTake(pedal.mutex, pdMS_TO_TICKS(MUTEX_TIMEOUT));
                pedal.apps1 = apps1;
                pedal.apps2 = apps2;
                pedal.bse = bse;
            xSemaphoreGive(pedal.mutex);
        
        
            //update the travel sensor's value
            xSemaphoreTake(travel_strain_oil_sensor.mutex, pdMS_TO_TICKS(MUTEX_TIMEOUT));
                travel_strain_oil_sensor.left = travel_transfer_function(adc_dma_buffer.travel_l);
                travel_strain_oil_sensor.right = travel_transfer_function(adc_dma_buffer.travel_r);
                travel_strain_oil_sensor.strain = adc_dma_buffer.strain;
                travel_strain_oil_sensor.oil_pressure = oil_transfer_function(adc_dma_buffer.oil);
            xSemaphoreGive(travel_strain_oil_sensor.mutex);
        
        }
        if(pending_notifications & FLAG_HALL_EDGE_LEFT) {
            xSemaphoreTake(hall_time_L.mutex, MUTEX_TIMEOUT);
                pending_notifications &= ~FLAG_HALL_EDGE_LEFT; //clear flags

                timer_time_t diff = {0};
                update_time_stamp(&hall_time_L_last, &hall_time_L, &diff);

                xSemaphoreTake(wheel_speed_sensor.mutex, MUTEX_TIMEOUT); 
                    wheel_speed_sensor.left = wheel_speed_tranfser_function(diff.elapsed_count, diff.timer_count);
                xSemaphoreGive(wheel_speed_sensor.mutex);
            xSemaphoreGive(hall_time_L.mutex);
        }
        if(pending_notifications & FLAG_HALL_EDGE_RIGHT) {
            xSemaphoreTake(hall_time_R.mutex, MUTEX_TIMEOUT);
                pending_notifications &= ~FLAG_HALL_EDGE_RIGHT; //clear flags

                timer_time_t diff = {0};
                update_time_stamp(&hall_time_R_last, &hall_time_R, &diff);

                xSemaphoreTake(wheel_speed_sensor.mutex, MUTEX_TIMEOUT);
                    wheel_speed_sensor.right = wheel_speed_tranfser_function(diff.elapsed_count, diff.timer_count);
                xSemaphoreGive(wheel_speed_sensor.mutex);
            xSemaphoreGive(hall_time_R.mutex);
        }
        if(pending_notifications & FLAG_READ_TIRE_TEMP) {
            pending_notifications &= ~FLAG_READ_TIRE_TEMP;
#ifdef USE_D6T
            //read the values from both sensors
            HAL_I2C_Mem_Read_DMA(
                &hi2c5,
                d6t_dma_buffer_R.addr_write, 
                d6t_dma_buffer_R.command, 
                1, 
                &(d6t_dma_buffer_R.PTAT.low), 
                sizeof(d6t_dma_buffer_R.PTAT)+sizeof(d6t_dma_buffer_R.temp)+sizeof(d6t_dma_buffer_R.PEC));
            HAL_I2C_Mem_Read_DMA(
                &hi2c1, 
                d6t_dma_buffer_L.addr_write, 
                d6t_dma_buffer_L.command, 
                1, 
                &(d6t_dma_buffer_L.PTAT.low), 
                sizeof(d6t_dma_buffer_L.PTAT)+sizeof(d6t_dma_buffer_L.temp)+sizeof(d6t_dma_buffer_L.PEC));
            wait for the DMA to finish, while we can do other stuff in the mean time
            //TODO: setup timeout exception and deal with error case where the stuff did not finish
#endif
        }
        if(pending_notifications & FLAG_I2C1_FINISH) {
            pending_notifications &= ~FLAG_I2C1_FINISH; //clear flags

            //TODO: CRC the data

            xSemaphoreTake(tire_temp_sensor.mutex, pdMS_TO_TICKS(MUTEX_TIMEOUT));
                for(int i=0; i<sizeof(d6t_dma_buffer_L.temp)/sizeof(d6t_dma_buffer_L.temp[0]); i++) {
                    tire_temp_sensor.left[i] = tire_temp_transfer_function(d6t_dma_buffer_L.temp[i].high, d6t_dma_buffer_L.temp[i].low);
                }
            xSemaphoreGive(tire_temp_sensor.mutex);
        }
        if(pending_notifications & FLAG_I2C5_FINISH) {
            pending_notifications &= ~FLAG_I2C5_FINISH; //clear flags

            //TODO: CRC the data

            xSemaphoreTake(tire_temp_sensor.mutex, pdMS_TO_TICKS(MUTEX_TIMEOUT));
                for(int i=0; i<sizeof(d6t_dma_buffer_R.temp)/sizeof(d6t_dma_buffer_R.temp[0]); i++) {
                    tire_temp_sensor.right[i] = tire_temp_transfer_function(d6t_dma_buffer_R.temp[i].high, d6t_dma_buffer_R.temp[i].low);
                }
            xSemaphoreGive(tire_temp_sensor.mutex);   
        }
        if(pending_notifications & FLAG_READ_STEER) {
            pending_notifications &= ~FLAG_READ_STEER; //clear flags

            //see https://www.cuidevices.com/product/resource/amt22.pdf
            //TODO: using hardware NSS right now because SCK jitters when NSS is switched by software for some reason
            //but hardware NSS does not observe 3us after all bytes transmission
            spi_tx_buffer[0] = 0;
            spi_tx_buffer[1] = 0;

            if(HAL_SPI_TransmitReceive_IT(&hspi4, spi_tx_buffer, spi_rx_buffer, 2) != HAL_OK) {
                steer_angle_period = STEER_PERIOD_ERR;
                break;
            }
            if(wait_for_notif_flags(FLAG_SPI4_FINISH, pdMS_TO_TICKS(SPI_TIMEOUT), &pending_notifications) != pdTRUE) {
                steer_angle_period = STEER_PERIOD_ERR;
                break;
            }
            else {
                steer_angle_period = STEER_PERIOD_NORMAL;
            }

            //TODO: CRC?

