NTURacingTeam/nturt_stm32_front_box/Core/Src/sensors.c
            //calculate position and put the stuff in to variables
            const uint8_t highByte = spi_rx_buffer[0];
            const uint8_t lowByte = spi_rx_buffer[1];
            const uint16_t position = ((uint16_t)highByte << 8) + (uint16_t)lowByte;
            xSemaphoreTake(steer_angle_sensor.mutex, MUTEX_TIMEOUT);
                steer_angle_sensor.steering_angle = steer_angle_transfer_function((position & 0x3FFF) >> 2);
            xSemaphoreGive(steer_angle_sensor.mutex);
        }
    }
}

/**
 * @brief wrapper function to wait for specific bits in the task notification
 * @param target the target that needs to be waited 
 * @param timeout the timeout in ticks
 * @param gotten all the flags that are set. target bits would be autocleared if they are gotten
 * @return the status of the function
 */
BaseType_t wait_for_notif_flags(uint32_t target, uint32_t timeout, uint32_t* const gotten) {    
    uint32_t flag_buf = 0U;
    uint32_t flag_gotten = *gotten;
    const TickType_t t0 = xTaskGetTickCount();
    TickType_t tlast = t0;
    
    //if either of which is not set
    while(~flag_gotten & target) {
        BaseType_t Wait_result = xTaskNotifyWait(0, 0xFFFFFFFFUL, &flag_buf, timeout-(tlast-t0));
        if(Wait_result == pdFALSE) {
            return pdFALSE; 
        }

        flag_gotten |= flag_buf;
        *gotten = flag_gotten;
        tlast = xTaskGetTickCount();
    } 

    //remove the gotten flags if the flags are correctly received
    *gotten &= ~(target);
    return pdTRUE;
}

/**
 * @brief this function initializes the payload data of the i2c addresses and the D6T sensors themselves
 * 
 * @param hi2c the i2c handle that handles the i2c communications
 * @param rawData and array that stores the data to be transmitted and that to be received
 * @param txThreadFlag the task notification flag used to indicate completion of transfer
 * @param otherflags the other flags that might be caught when are waiting for the the DMA to complete through FreeRTOS notifications
 */
static uint8_t init_D6T(I2C_HandleTypeDef* const hi2c, volatile i2c_d6t_dma_buffer_t* rawData, uint32_t txThreadFlag, uint32_t* otherflags) {
    //TODO: use the return value to report error
    //fixed parameters of D6T sensors: address, I2C command to get data, and the startup transmissions
    const uint8_t D6Taddr = 0b0001010;
    const uint8_t getCommand = 0x4C;
    const uint8_t startupCommand[5][4] = {
        {0x02, 0x00, 0x01, 0xEE},
        {0x05, 0x90, 0x3A, 0xB8},
        {0x03, 0x00, 0x03, 0x8B},
        {0x03, 0x00, 0x07, 0x97},
        {0x92, 0x00, 0x00, 0xE9}
    };

    //fill the first 3 bytes of rawData with these data since they will be used in CRC
    rawData->addr_write = D6Taddr<<1;
    rawData->command = getCommand;
    rawData->addr_read = (D6Taddr << 1) + 1;

    //init sensor 
    if(HAL_I2C_IsDeviceReady(hi2c, D6Taddr << 1, 5, 0xF) == HAL_OK) {
        for(int i = 0; i<5; i++) {
            HAL_I2C_Master_Transmit_DMA(hi2c, D6Taddr << 1, startupCommand[i], 4);
            if(wait_for_notif_flags(txThreadFlag, I2C_TIMEOUT, otherflags) != pdTRUE) {
                return 1;
            }
        }
    } else {
        return 1;
    }
    return 0;
}

/**
 * @brief this function calculates the difference between last and now, and updates the "now" time to "last"
 * 
 * @param last previous time this function is called
 * @param now the new time stamp at which this time is called
 * @param diff calculates the time difference between last and now
 */
void update_time_stamp(timer_time_t* last, volatile const timer_time_t* now, timer_time_t* diff) {
    diff->elapsed_count = now->elapsed_count - last->elapsed_count;
    diff->timer_count = now->timer_count - last->timer_count;

    if(now->timer_count < last->timer_count) {
        diff->elapsed_count -= 1;
    }
    last->elapsed_count = now->elapsed_count;
    last->timer_count = now->timer_count;
}

static uint8_t ADC_request_retry(ADC_HandleTypeDef* hadc, uint16_t* buffer, uint8_t length, const uint8_t count) {
    uint8_t toReturn = 0;
    for(int i = 0; i<length; i++) {
        if(HAL_ADC_Start_DMA(hadc, (uint32_t*)buffer, length) != HAL_OK) {
            toReturn = 1;
            vTaskDelay(pdMS_TO_TICKS(1));
        }
        else {
            toReturn = 0;
            break;
        }
    }

    return toReturn;
}

static uint8_t ADC_retry(ADC_HandleTypeDef* hadc, uint16_t* buffer, uint8_t length, uint8_t count, uint32_t* notifications) {
    if(ADC_request_retry(hadc, buffer, length, count)) {
        return 1;
    }
    if(wait_for_notif_flags(FLAG_ADC1_FINISH, pdMS_TO_TICKS(ADC_RETRY_TIMEOUT), notifications) != pdTRUE) {
        return 1;
    }
    return 0;
}

void HAL_I2C_MasterTxCpltCallback(I2C_HandleTypeDef *hi2c) {
    xTaskNotifyFromISR(sensors_data_task_handle, FLAG_D6T_STARTUP, eSetBits, NULL);
}

void HAL_I2C_MemRxCpltCallback(I2C_HandleTypeDef *hi2c) {
    if(hi2c == &hi2c1) {
        xTaskNotifyFromISR(sensors_data_task_handle, FLAG_I2C1_FINISH, eSetBits, NULL);
    }
    else if (hi2c == &hi2c5) {
        xTaskNotifyFromISR(sensors_data_task_handle, FLAG_I2C5_FINISH, eSetBits, NULL);
    }
}

void HAL_ADC_ConvCpltCallback(ADC_HandleTypeDef* hadc) {
    if(hadc == &hadc1) {
        xTaskNotifyFromISR(sensors_data_task_handle, FLAG_ADC1_FINISH, eSetBits, NULL);
    } else if(hadc == &hadc3) {
        xTaskNotifyFromISR(sensors_data_task_handle, FLAG_ADC3_FINISH, eSetBits, NULL);
    }
}

#ifdef USE_HALL_SENSOR
void __hall_timer_elapsed(TIM_HandleTypeDef *htim) {
    (void)htim;
    hall_timer_elapsed++;
}

void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin) {    
    if(GPIO_Pin == HALL_L_Pin) {
        if(xSemaphoreTakeFromISR(hall_time_L.mutex, NULL) == pdTRUE) {
            hall_time_L.timer_count = __HAL_TIM_GET_COUNTER(&htim7);
            hall_time_L.elapsed_count = hall_timer_elapsed;
            xTaskNotifyFromISR(sensors_data_task_handle, FLAG_HALL_EDGE_LEFT, eSetBits, NULL);
            xSemaphoreGiveFromISR(hall_time_L.mutex, NULL);
        }
    }   
    if(GPIO_Pin == HALL_R_Pin) {
        if(xSemaphoreTakeFromISR(hall_time_R.mutex, NULL) == pdTRUE) {
            hall_time_R.timer_count = __HAL_TIM_GET_COUNTER(&htim7);
            hall_time_R.elapsed_count = hall_timer_elapsed;
            xTaskNotifyFromISR(sensors_data_task_handle, FLAG_HALL_EDGE_RIGHT, eSetBits, NULL);
            xSemaphoreGiveFromISR(hall_time_R.mutex, NULL);
        }
    }
}
#endif

void HAL_SPI_TxRxCpltCallback(SPI_HandleTypeDef *hspi) {
    if(hspi == &hspi4) {
    	xTaskNotifyFromISR(sensors_data_task_handle, FLAG_SPI4_FINISH, eSetBits, NULL);
    }
}

void sensor_init(void) {
    sensors_data_task_handle = xTaskCreateStatic(
        sensor_handler, "sensors_data_task", SENSOR_DATA_TASK_STACK_SIZE, NULL,
        TaskPriorityHigh, sensors_data_task_buffer, &sensors_data_task_cb);

    sensor_timer_handle = xTimerCreateStatic(
        "sensors_data_timer", pdMS_TO_TICKS(SENSOR_TIMER_PERIOD), pdTRUE, 0,
        sensor_timer_callback, &sensor_timer_buffer);

    //create all the necessary mutexes
    hall_time_L.mutex = xSemaphoreCreateMutex();
    hall_time_R.mutex = xSemaphoreCreateMutex();
    pedal.mutex = xSemaphoreCreateMutex();
    travel_strain_oil_sensor.mutex = xSemaphoreCreateMutex();
    tire_temp_sensor.mutex = xSemaphoreCreateMutex();
    steer_angle_sensor.mutex = xSemaphoreCreateMutex();
    wheel_speed_sensor.mutex = xSemaphoreCreateMutex();
    filter_init();
    return;
}

static void filter_init() {
  for (int i = 0; i < NUM_FILTER; i++) {
    MovingAverageFilter_ctor(&moving_average_filter[i], moving_average_buffer[i],
                             MOVING_AVERAGE_FILTER_MOVING_AVERAGE_SIZE, NULL);
  }
}